# NetworkErrorElementWithDownUpStreamNode Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPCalculationFailures..::..NetworkErrorElementWithDownUpStreamNode Property
BuiltInFailures..::..MEPCalculationFailures Class See Also
---
The network needs an input or output element to perform the calculation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NetworkErrorElementWithDownUpStreamNode { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NetworkErrorElementWithDownUpStreamNode As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NetworkErrorElementWithDownUpStreamNode {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPCalculationFailures Class
Autodesk.Revit.DB Namespace